QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/inc/hw_fsi.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_INT1_CTRL register
//
//*************************************************************************************************
#define FSI_RX_INT1_CTRL_INT1_EN_PING_WD_TO \
    0x1U // Enable Ping Watchdog Timeout Interrupt
         // to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_WD_TO \
    0x2U                                      // Enable Frame Watchdog Timeout
                                              // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_CRC_ERR 0x4U // Enable CRC Error Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_TYPE_ERR \
    0x8U // Enable Frame Type Error Interrupt to
         // INT1
#define FSI_RX_INT1_CTRL_INT1_EN_EOF_ERR \
    0x10U // Enable End-of-Frame Error Interrupt to
          // INT1
#define FSI_RX_INT1_CTRL_INT1_EN_OVERRUN \
    0x20U                                         // Enable Receive Buffer Overrun
                                                  // Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_DONE 0x40U // Enable Frame Done Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_UNDERRUN \
    0x80U // Enable Buffer Underrun Interrupt to
          // INT1
#define FSI_RX_INT1_CTRL_INT1_EN_ERR_FRAME \
    0x100U // Enable Error Frame Received Interrupt
           // to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_PING_FRAME \
    0x200U                                            // Enable Ping Frame Received Interrupt
                                                      // to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_FRAME_OVERRUN 0x400U // Enable Frame Overrun Interrupt to INT1
#define FSI_RX_INT1_CTRL_INT1_EN_DATA_FRAME \
    0x800U // Enable Data Frame Received Interrupt
           // to INT1

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_INT2_CTRL register
//
//*************************************************************************************************
#define FSI_RX_INT2_CTRL_INT2_EN_PING_WD_TO \
    0x1U // Enable Ping Watchdog Timeout Interrupt
         // to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_WD_TO \
    0x2U                                      // Enable Frame Watchdog Timeout
                                              // Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_CRC_ERR 0x4U // Enable CRC Errror Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_TYPE_ERR \
    0x8U // Enable Frame Type Error Interrupt to
         // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_EOF_ERR \
    0x10U // Enable End-of-Frame Error Interrupt to
          // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_OVERRUN \
    0x20U                                         // Enable Buffer Overrun Interrupt to
                                                  // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_DONE 0x40U // Enable Frame Done Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_UNDERRUN \
    0x80U // Enable Buffer Underrun Interrupt to
          // INT2
#define FSI_RX_INT2_CTRL_INT2_EN_ERR_FRAME \
    0x100U // Enable Error Frame Received Interrupt
           // to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_PING_FRAME \
    0x200U                                            // Enable Ping Frame Received Interrupt
                                                      // to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_FRAME_OVERRUN 0x400U // Enable Frame Overrun Interrupt to INT2
#define FSI_RX_INT2_CTRL_INT2_EN_DATA_FRAME \
    0x800U // Enable Data Frame Received Interrupt
           // to INT2

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_LOCK_CTRL register
//
//*************************************************************************************************
#define FSI_RX_LOCK_CTRL_LOCK  0x1U // Control Register Lock Enable
#define FSI_RX_LOCK_CTRL_KEY_S 8U
#define FSI_RX_LOCK_CTRL_KEY_M 0xFF00U // Write Key

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_DATA register
//
//*************************************************************************************************
#define FSI_RX_ECC_DATA_DATA_LOW_S  0U
#define FSI_RX_ECC_DATA_DATA_LOW_M  0xFFFFU // ECC Data Lower 16 Bits
#define FSI_RX_ECC_DATA_DATA_HIGH_S 16U
#define FSI_RX_ECC_DATA_DATA_HIGH_M 0xFFFF0000U // ECC Data Upper 16 Bits

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_VAL register
//
//*************************************************************************************************
#define FSI_RX_ECC_VAL_ECC_VAL_S 0U
#define FSI_RX_ECC_VAL_ECC_VAL_M 0x7FU // Computed ECC Value

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_ECC_LOG register
//
//*************************************************************************************************
#define FSI_RX_ECC_LOG_SBE 0x1U // Single Bit Error Detected
#define FSI_RX_ECC_LOG_MBE 0x2U // Multiple Bit Errors Detected

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_DLYLINE_CTRL register
//
//*************************************************************************************************
#define FSI_RX_DLYLINE_CTRL_RXCLK_DLY_S 0U
#define FSI_RX_DLYLINE_CTRL_RXCLK_DLY_M 0x1FU // Delay Line Tap Select for RXCLK
#define FSI_RX_DLYLINE_CTRL_RXD0_DLY_S  5U
#define FSI_RX_DLYLINE_CTRL_RXD0_DLY_M  0x3E0U // Delay Line Tap Select for RXD0
#define FSI_RX_DLYLINE_CTRL_RXD1_DLY_S  10U
#define FSI_RX_DLYLINE_CTRL_RXD1_DLY_M  0x7C00U // Delay Line Tap Select for RXD1

//*************************************************************************************************
//
// The following are defines for the bit fields in the RX_VIS_1 register
//
//*************************************************************************************************
#define FSI_RX_VIS_1_RX_CORE_STS 0x8U // Receiver Core Status

#endif
